In [ ]:
import pandas as pd

In [ ]:
df = pd.read_csv("https://www.stats.govt.nz/assets/Uploads/Business-employment-data/Business-employment-data-September-2020-quarter/Download-data/business-employment-data-september-2020-quarter-csv.zip")

In [ ]:
df.head()

  Series_reference   Period  ...  Series_title_4 Series_title_5
0      BDCQ.SEA1AA  2011.06  ...             NaN            NaN
1      BDCQ.SEA1AA  2011.09  ...             NaN            NaN
2      BDCQ.SEA1AA  2011.12  ...             NaN            NaN
3      BDCQ.SEA1AA  2012.03  ...             NaN            NaN
4      BDCQ.SEA1AA  2012.06  ...             NaN            NaN

[5 rows x 14 columns]

In [ ]:
df.describe()

             Period    Data_value     Magnitude  Series_title_4  Series_title_5
count  12001.000000  1.197000e+04  12001.000000             0.0             0.0
mean    2015.571710  4.909224e+04      2.204316             NaN             NaN
std        2.755918  1.557601e+05      2.892678             NaN             NaN
min     2011.060000 -3.829897e+00      0.000000             NaN             NaN
25%     2013.090000  6.904644e+02      0.000000             NaN             NaN
50%     2015.120000  6.995000e+03      0.000000             NaN             NaN
75%     2018.060000  2.610650e+04      6.000000             NaN             NaN
max     2020.090000  2.134716e+06      6.000000             NaN             NaN

In [ ]:
df.columns.values

array(['Series_reference', 'Period', 'Data_value', 'Suppressed', 'STATUS',
       'UNITS', 'Magnitude', 'Subject', 'Group', 'Series_title_1',
       'Series_title_2', 'Series_title_3', 'Series_title_4',
       'Series_title_5'], dtype=object)

In [ ]:
columns_to_be_selected = ["Data_value", "Series_title_1", "Series_title_2"]

In [ ]:
df[columns_to_be_selected]

       Data_value  ...                      Series_title_2
0         80078.0  ...   Agriculture, Forestry and Fishing
1         78324.0  ...   Agriculture, Forestry and Fishing
2         85850.0  ...   Agriculture, Forestry and Fishing
3         90743.0  ...   Agriculture, Forestry and Fishing
4         81780.0  ...   Agriculture, Forestry and Fishing
...           ...  ...                                 ...
11996         NaN  ...  Area Outside Territorial Authority
11997         NaN  ...  Area Outside Territorial Authority
11998         NaN  ...  Area Outside Territorial Authority
11999         NaN  ...  Area Outside Territorial Authority
12000         NaN  ...  Area Outside Territorial Authority

[12001 rows x 3 columns]

In [ ]:
row_index_to_select = [0, 1, 4, 5]
df.loc[row_index_to_select]

  Series_reference   Period  ...  Series_title_4 Series_title_5
0      BDCQ.SEA1AA  2011.06  ...             NaN            NaN
1      BDCQ.SEA1AA  2011.09  ...             NaN            NaN
4      BDCQ.SEA1AA  2012.06  ...             NaN            NaN
5      BDCQ.SEA1AA  2012.09  ...             NaN            NaN

[4 rows x 14 columns]

In [ ]:
df["Data_value"].sum()

587634084.0375841

In [ ]:
df["Data_value"].mean()

49092.23759712479

In [ ]:
df["Data_value"].min()
df["Data_value"].max()
df["Data_value"].median()
df["Data_value"].mode()

0     287.0
1     292.0
2    2841.0
3    5048.0
4    7859.0
dtype: float64